<a href="https://colab.research.google.com/github/MarkHallett/-CoLab/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Mark Hallett Pandas cheat sheet

## General

In [0]:
import pandas as pd
import numpy as np

In [18]:
d = ({'A':1,'B':'b','C':2.2})
df = pd.DataFrame(d,[0])
df.dtypes

A      int64
B     object
C    float64
dtype: object

In [20]:
df.head(5)

   A  B    C
0  1  b  2.2

In [22]:
df.index

Int64Index([0], dtype='int64')

In [23]:
df.describe()

         A    C
count  1.0  1.0
mean   1.0  2.2
std    NaN  NaN
min    1.0  2.2
25%    1.0  2.2
50%    1.0  2.2
75%    1.0  2.2
max    1.0  2.2

In [24]:
df.T

     0
A    1
B    b
C  2.2

In [25]:
df

   A  B    C
0  1  b  2.2

## Data Into df

In [2]:
import pandas as pd
data1 = { 'a':['b','c'] ,  'B':['A','B'] , 'c':['1','2'] , 'd':['1','2']   }

pd1 = pd.DataFrame(data1)
pd1

   B  a  c  d
0  A  b  1  1
1  B  c  2  2

In [7]:
df2 = pd.DataFrame(
              { 'A' : 1., # All one vlaue
                'B' : pd.Timestamp('20130102'),   # date                   
                'C ' :pd.Series(1,index=list(range(4)),dtype='float32'), # series
                'D' : np.array([3] * 4,dtype='int32'), # array
                'E' : pd.Categorical(["test","train","test","train"]),
                'F' : 'foo', 
                'G' : [1,2,3,4]  # list
              })
df2

     A          B   C   D      E    F  G
0  1.0 2013-01-02  1.0  3   test  foo  1
1  1.0 2013-01-02  1.0  3  train  foo  2
2  1.0 2013-01-02  1.0  3   test  foo  3
3  1.0 2013-01-02  1.0  3  train  foo  4

In [12]:
# eg dates and data
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [60]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.337425  0.419965  0.064828  0.065867
2013-01-02  0.715076  0.896451  0.093573  1.164690
2013-01-03  2.244118  1.075180 -0.458979 -0.642527
2013-01-04  1.139121  0.568490  0.136447  1.537521
2013-01-05  1.549626  0.549848 -0.936035 -0.419732
2013-01-06 -0.099543  0.731738 -0.648349  1.211823

## Add to DataFrame

In [49]:
df = pd.DataFrame({ 'a':[1,2], 'b':[1,2], 'c':[1,2],  })

df['D'] = [10,11]
df

   a  b  c   D
0  1  1  1  10
1  2  2  2  11

## Update data

In [76]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [77]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -0.337425  0.419965  0.064828  0.065867  NaN
2013-01-02  0.715076  0.896451  0.093573  1.164690  1.0
2013-01-03  2.244118  1.075180 -0.458979 -0.642527  2.0
2013-01-04  1.139121  0.568490  0.136447  1.537521  3.0
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  4.0
2013-01-06 -0.099543  0.731738 -0.648349  1.211823  5.0

In [78]:
# by value
df.at[dates[0],'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.419965  0.064828  0.065867  NaN
2013-01-02  0.715076  0.896451  0.093573  1.164690  1.0
2013-01-03  2.244118  1.075180 -0.458979 -0.642527  2.0
2013-01-04  1.139121  0.568490  0.136447  1.537521  3.0
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  4.0
2013-01-06 -0.099543  0.731738 -0.648349  1.211823  5.0

In [79]:
df.iat[0,1] = 0.1
df

                   A         B         C         D    F
2013-01-01  0.000000  0.100000  0.064828  0.065867  NaN
2013-01-02  0.715076  0.896451  0.093573  1.164690  1.0
2013-01-03  2.244118  1.075180 -0.458979 -0.642527  2.0
2013-01-04  1.139121  0.568490  0.136447  1.537521  3.0
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  4.0
2013-01-06 -0.099543  0.731738 -0.648349  1.211823  5.0

In [81]:
# whole column, update with numpy array
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.100000  0.064828  5  NaN
2013-01-02  0.715076  0.896451  0.093573  5  1.0
2013-01-03  2.244118  1.075180 -0.458979  5  2.0
2013-01-04  1.139121  0.568490  0.136447  5  3.0
2013-01-05  1.549626  0.549848 -0.936035  5  4.0
2013-01-06 -0.099543  0.731738 -0.648349  5  5.0

In [82]:
# where on whole df
df2 = df.copy()
df2[df2 < 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.100000  0.064828  5  NaN
2013-01-02  0.715076  0.896451  0.093573  5  1.0
2013-01-03  2.244118  1.075180  0.458979  5  2.0
2013-01-04  1.139121  0.568490  0.136447  5  3.0
2013-01-05  1.549626  0.549848  0.936035  5  4.0
2013-01-06  0.099543  0.731738  0.648349  5  5.0

## Modify DataFrame

In [28]:
#sort by axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.125366 -0.250743 -0.727355 -0.614316
2013-01-02  1.273794 -0.449667 -0.488096  0.330320
2013-01-03 -0.144976  0.277706  0.079873 -1.173828
2013-01-04 -1.203602  0.383898  1.510191 -0.220848
2013-01-05 -0.308972 -0.126518 -1.127420  0.657156
2013-01-06  0.104411  1.232420 -0.625490 -1.850150

In [29]:
# sort by data
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.657156 -1.127420 -0.126518 -0.308972
2013-01-01 -0.614316 -0.727355 -0.250743 -1.125366
2013-01-06 -1.850150 -0.625490  1.232420  0.104411
2013-01-02  0.330320 -0.488096 -0.449667  1.273794
2013-01-03 -1.173828  0.079873  0.277706 -0.144976
2013-01-04 -0.220848  1.510191  0.383898 -1.203602

## Delete from DataFrame

## Reshape DataFrame

## Select from DataFrame

In [30]:
df['A']

2013-01-01   -0.614316
2013-01-02    0.330320
2013-01-03   -1.173828
2013-01-04   -0.220848
2013-01-05    0.657156
2013-01-06   -1.850150
Freq: D, Name: A, dtype: float64

In [32]:
# by row number
df[0:3]

                   A         B         C         D
2013-01-01 -0.614316 -0.727355 -0.250743 -1.125366
2013-01-02  0.330320 -0.488096 -0.449667  1.273794
2013-01-03 -1.173828  0.079873  0.277706 -0.144976

In [34]:
# select by locationn, label (index number)
df.loc[dates[0]]

A   -0.614316
B   -0.727355
C   -0.250743
D   -1.125366
Name: 2013-01-01 00:00:00, dtype: float64

In [36]:
# select by location, index and columns
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.330320 -0.488096
2013-01-03 -1.173828  0.079873
2013-01-04 -0.220848  1.510191

In [37]:
# select by location number ( index, columns)
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.220848  1.510191
2013-01-05  0.657156 -1.127420

In [38]:
# select specific location by number
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.330320 -0.449667
2013-01-03 -1.173828  0.277706
2013-01-05  0.657156 -0.126518

In [39]:
# select a whole row 
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.330320 -0.488096 -0.449667  1.273794
2013-01-03 -1.173828  0.079873  0.277706 -0.144976

In [41]:
# select a whole column
df.iloc[:,:2:3]

                   A
2013-01-01 -0.614316
2013-01-02  0.330320
2013-01-03 -1.173828
2013-01-04 -0.220848
2013-01-05  0.657156
2013-01-06 -1.850150

In [42]:
# single value
 df.iloc[1,1]  # or faster df.iat[1,1]

-0.48809592032947724

In [43]:
# select where (select row where value ..)
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.330320 -0.488096 -0.449667  1.273794
2013-01-05  0.657156 -1.127420 -0.126518 -0.308972

In [45]:
# select value where value ...
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  0.330320       NaN       NaN  1.273794
2013-01-03       NaN  0.079873  0.277706       NaN
2013-01-04       NaN  1.510191  0.383898       NaN
2013-01-05  0.657156       NaN       NaN       NaN
2013-01-06       NaN       NaN  1.232420  0.104411

In [70]:
# select where row where value is in ...

df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']

df2[ df2['E'].isin(['one','four',]) ]

                   A         B         C         D     E
2013-01-01 -0.337425  0.419965  0.064828  0.065867   one
2013-01-02  0.715076  0.896451  0.093573  1.164690   one
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  four

## Missing data ...

In [83]:
np.NaN

nan

## Unclassified